Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КупляПродажаСписокНоменклатуры.Номенклатура,
	|	СУММА(КупляПродажаСписокНоменклатуры.Количество) КАК Количество,
	|	СУММА(КупляПродажаСписокНоменклатуры.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВремТ
	|ИЗ
	|	Документ.КупляПродажа.СписокНоменклатуры КАК КупляПродажаСписокНоменклатуры
	|ГДЕ
	|	КупляПродажаСписокНоменклатуры.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	КупляПродажаСписокНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТ.Номенклатура КАК Номенклатура,
	|	ВремТ.Количество КАК Количество,
	|	ВремТ.Сумма,
	|	УправленческийОстатки.Субконто4,
	|	ЕстьNull(УправленческийОстатки.КоличесвоОстаток,0) КАК КоличесвоОстаток,
	|	ЕстьNull(УправленческийОстатки.СуммаОстаток,0) как СуммаОстаток
	|ИЗ
	|	ВремТ КАК ВремТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(&Дата, Счет = &Товары, &Субконто, Субконто1 В
	|			(ВЫБРАТЬ
	|				ВремТ.Номенклатура
	|			ИЗ
	|				ВремТ КАК ВремТ)
	|		И Субконто2 = &ОрганизацияПоставщика
	|		И Субконто3 = &СкладПоставщика) КАК УправленческийОстатки
	|		ПО ВремТ.Номенклатура = УправленческийОстатки.Субконто1
	|ИТОГИ
	|	МАКСИМУМ(Количество) КАК Количество,
	|	СУММА(КоличесвоОстаток)
	|ПО
	|	Номенклатура";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Субконто = Новый массив;
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Организация);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Склад);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Партия);
	Запрос.УстановитьПараметр("Субконто", Субконто);
	Запрос.УстановитьПараметр("СкладПоставщика", СкладПоставщика);
	Запрос.УстановитьПараметр("ОрганизацияПоставщика", ОрганизацияПоставщик);
	Запрос.УстановитьПараметр("Товары", ПланыСчетов.Управленческий.Товары);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличесвоОстаток Тогда
			Отказ = Истина;
			Сообщить("Товара " + ВыборкаНоменклатура.Номенклатура + " нет. ЕСть только = "
				+ ВыборкаНоменклатура.КоличесвоОстаток);
			Продолжить;
		КонецЕсли;
		Если Не Отказ Тогда
			Выборка = ВыборкаНоменклатура.Выбрать();
			Осталось = ВыборкаНоменклатура.Количество;
			Пока Выборка.Следующий() Цикл
				Движение = Движения.Управленческий.Добавить();
				Движение.Период = Дата;
				Движение.СчетДт = ПланыСчетов.Управленческий.ПрибылиУбытки;
				Движение.СчетКт = ПланыСчетов.Управленческий.Товары;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Организация] = ОрганизацияПоставщик;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Партия] =Выборка.Субконто4;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = СкладПоставщика;
				Движение.Количесво = Мин(Осталось, Выборка.КоличесвоОстаток);
				Движение.СуммаДт = Движение.Количесво / Выборка.КоличесвоОстаток * Выборка.СуммаОстаток;
				Движение.СуммаКт = Движение.Количесво / Выборка.КоличесвоОстаток * Выборка.СуммаОстаток;
				
				Движение = Движения.Управленческий.Добавить();
				Движение.Период = Дата;
				Движение.СчетДт = ПланыСчетов.Управленческий.Товары;
				Движение.СчетКт = ПланыСчетов.Управленческий.Поставщики;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Организация] = ОрганизацияПокупатель;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Партия] =Выборка.Субконто4;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = СкладПокупателя;
				Движение.Количесво = Мин(Осталось, Выборка.КоличесвоОстаток);
				Движение.СуммаДт = Движение.Количесво / Выборка.Количество * Выборка.Сумма;
				Движение.СуммаКт = Движение.Количесво / Выборка.Количество * Выборка.Сумма;
				Осталось =Осталось -  Мин(Осталось, Выборка.КоличесвоОстаток);;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Движения.Управленческий.Записывать = Истина;
	Движение = Движения.Управленческий.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = ПланыСчетов.Управленческий.Покупатели;
	Движение.СчетКт = ПланыСчетов.Управленческий.ПрибылиУбытки;
	Движение.СуммаДт = СписокНоменклатуры.Итог("Сумма");
	Движение.СуммаКт = СписокНоменклатуры.Итог("Сумма");

КонецПроцедуры