Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеНачисления из ОсновныеНачисления Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ДатаОкончания;
		Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
		Движение.Подразделение = ТекСтрокаОсновныеНачисления.Подразделение;
		Движение.График=ТекСтрокаОсновныеНачисления.График;
	КонецЦикла;

	// регистр ДополнительныеНачисления
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаДополнительныеНачисленияя из ДополнительныеНачисления Цикл
		Движение = Движения.ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаДополнительныеНачисленияя.ВидРасчета;
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Дата,-1 ));
		Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Дата,-1 ));
		Движение.Сотрудник = ТекСтрокаДополнительныеНачисленияя.Сотрудник;
		Движение.Подразделение = ТекСтрокаДополнительныеНачисленияя.Подразделение;
		Движение.Процент =ТекСтрокаДополнительныеНачисленияя.Процент;
	КонецЦикла;
	Движения.Записать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОсновныеНачисленияДанныеГрафика.НомерСтроки,
		|	ОсновныеНачисленияДанныеГрафика.График,
		|	ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия
		|ПОМЕСТИТЬ ВременнаяТаблица1
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ОсновныеНачисленияДанныеГрафика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица1.НомерСтроки,
		|	ВременнаяТаблица1.ЗначениеФактическийПериодДействия,
		|	ЕстьNull(СведенияОСотрудникахСрезПоследних.Тариф,0) как Тариф
		|ИЗ
		|	ВременнаяТаблица1 КАК ВременнаяТаблица1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСотрудниках.СрезПоследних(&Дата, График В
		|			(ВЫБРАТЬ
		|				ВременнаяТаблица1.График
		|			ИЗ
		|				ВременнаяТаблица1 КАК ВременнаяТаблица1)) КАК СведенияОСотрудникахСрезПоследних
		|		ПО ВременнаяТаблица1.График = СведенияОСотрудникахСрезПоследних.График";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Для каждого СтрокаДвижения из Движения.ОсновныеНачисления Цикл
		Если СтрокаДвижения.ВидРасчета.Алгоритм <> Перечисления.Алгоритмы.РасчетТарифа тогда
			продолжить;
		КонецЕСли;
		Выборка.Сбросить();
		Выборка.НайтиСледующий(СтрокаДвижения.НомерСтроки, "НомерСтроки");
		СтрокаДвижения.Результат = Выборка.ЗначениеФактическийПериодДействия*Выборка.Тариф;
	КонецЦикла;
	Движения.ОсновныеНачисления.Записать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки,
		|	ЕстьNull(ДополнительныеНачисленияБазаОсновныеНачисления.РезультатБаза,0) - ЕстьNull(ДополнительныеНачисленияБазаОсновныеНачисления1.РезультатБаза,0) как РезультатБаза,
		|	ДополнительныеНачисленияБазаОсновныеНачисления.Процент
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(&ИзмерениеПодразделение, &ИзмерениеПодразделение,,
		|		Регистратор = &Ссылка) КАК ДополнительныеНачисленияБазаОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(&ИзмерениеСотрудник,
		|			&ИзмерениеСотрудник,, Регистратор = &Ссылка) КАК ДополнительныеНачисленияБазаОсновныеНачисления1
		|		ПО ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки = ДополнительныеНачисленияБазаОсновныеНачисления1.НомерСтроки";
	ИзмерениеСотрудник = новый массив;
	ИзмерениеСотрудник.Добавить("Сотрудник");
	ИзмерениеСотрудник.Добавить("Подразделение");
	Запрос.УстановитьПараметр("ИзмерениеСотрудник", ИзмерениеСотрудник);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ИзмерениеПодразделение = новый массив;
	ИзмерениеПодразделение.Добавить("Подразделение");
	Запрос.УстановитьПараметр("ИзмерениеПодразделение", ИзмерениеПодразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Не РезультатЗапроса.Пустой() Тогда
		Для Каждого СтрокаДвижения Из Движения.ДополнительныеНачисления Цикл
			Если СтрокаДвижения.ВидРасчета.Алгоритм <> Перечисления.Алгоритмы.РасчетПримии Тогда
				Продолжить;
			КонецЕсли;
			Выборка.Сбросить();
			Выборка.НайтиСледующий(СтрокаДвижения.НомерСтроки, "НомерСтроки");
			СтрокаДвижения.Результат = ?(Выборка.РезультатБаза = 0, 0, Выборка.РезультатБаза * Выборка.Процент / 100);
		КонецЦикла;
	КонецЕсли;
	Движения.ДополнительныеНачисления.Записать();

КонецПроцедуры